from clilib import *


def demo():
    ui.clear()

    # Крутой ASCII-заголовок
    ui.ascii_text("HACKER TOOL", "big", Fore.RED)

    br()
    for i in ui.progress_bar(range(100), "Взлом пентагона"):
        time.sleep(0.02)  # Имитация работы
    br()

    # Таблица с результатами
    ui.table(
        ["Система", "Статус", "Уровень доступа"],
        [
            ["Пентагон", "ВЗЛОМАН", "100%"],
            ["ФБР", "В процессе", "45%"],
            ["NASA", "Заблокирована", "0%"]
        ],
        "🎯 РЕЗУЛЬТАТЫ АТАКИ"
    )

    # Простой выбор
    action = choice("Что делаем дальше?", [
        "Продолжить взлом",
        "Скрыть следы",
        "Самоликвидироваться"
    ])
    br()
    br()
    p(f"answer: {action}")
    br()
    if ui.yesno("Точно запускать вирус?"):
        p("💀 Вирус активирован!", Fore.RED)
    else:
        p("Ну и славно", Fore.LIGHTGREEN_EX)
        br()
        br()
        ui.input("Твой ответ: ")


if __name__ == "__main__":
    demo()
    input()